Revit 2027 API
GeometryElement.MaterialElement Property
Element describing the material from which this element is composed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Material MaterialElement { get; }
Public ReadOnly Property MaterialElement As Material
	Get
public:
property Material^ MaterialElement {
	Material^ get ();
}
member MaterialElement : Material with get
Property Value
Material
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace